{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<cls>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "post_processor": null,
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<cls>": 4,
      "<sep>": 5,
      "<mask>": 6,
      "\n": 7,
      "!": 8,
      "\"": 9,
      "#": 10,
      "$": 11,
      "%": 12,
      "&": 13,
      "'": 14,
      "*": 15,
      "+": 16,
      ",": 17,
      "-": 18,
      ".": 19,
      "/": 20,
      "0": 21,
      "1": 22,
      "2": 23,
      "3": 24,
      "4": 25,
      "5": 26,
      "6": 27,
      "7": 28,
      "8": 29,
      "9": 30,
      ":": 31,
      ";": 32,
      "<": 33,
      "=": 34,
      ">": 35,
      "?": 36,
      "@": 37,
      "A": 38,
      "B": 39,
      "C": 40,
      "D": 41,
      "E": 42,
      "F": 43,
      "G": 44,
      "H": 45,
      "I": 46,
      "J": 47,
      "K": 48,
      "L": 49,
      "M": 50,
      "N": 51,
      "O": 52,
      "P": 53,
      "Q": 54,
      "R": 55,
      "S": 56,
      "T": 57,
      "U": 58,
      "V": 59,
      "W": 60,
      "X": 61,
      "Y": 62,
      "Z": 63,
      "[": 64,
      "\\": 65,
      "]": 66,
      "^": 67,
      "_": 68,
      "`": 69,
      "a": 70,
      "b": 71,
      "c": 72,
      "d": 73,
      "e": 74,
      "f": 75,
      "g": 76,
      "h": 77,
      "i": 78,
      "j": 79,
      "k": 80,
      "l": 81,
      "m": 82,
      "n": 83,
      "o": 84,
      "p": 85,
      "q": 86,
      "r": 87,
      "s": 88,
      "t": 89,
      "u": 90,
      "v": 91,
      "w": 92,
      "x": 93,
      "y": 94,
      "z": 95,
      "|": 96,
      "~": 97,
      "¥": 98,
      "§": 99,
      "©": 100,
      "°": 101,
      "±": 102,
      "·": 103,
      "À": 104,
      "Á": 105,
      "Â": 106,
      "Ã": 107,
      "Ä": 108,
      "Å": 109,
      "Æ": 110,
      "Ç": 111,
      "È": 112,
      "É": 113,
      "Ê": 114,
      "Ë": 115,
      "Ì": 116,
      "Í": 117,
      "Î": 118,
      "Ï": 119,
      "Ð": 120,
      "Ñ": 121,
      "Ò": 122,
      "Ó": 123,
      "Ô": 124,
      "Õ": 125,
      "Ö": 126,
      "×": 127,
      "Ø": 128,
      "Ù": 129,
      "Ú": 130,
      "Û": 131,
      "Ü": 132,
      "Þ": 133,
      "ß": 134,
      "à": 135,
      "á": 136,
      "â": 137,
      "ã": 138,
      "ä": 139,
      "å": 140,
      "æ": 141,
      "ç": 142,
      "è": 143,
      "é": 144,
      "ê": 145,
      "ë": 146,
      "ì": 147,
      "í": 148,
      "î": 149,
      "ï": 150,
      "ð": 151,
      "ñ": 152,
      "ò": 153,
      "ó": 154,
      "ô": 155,
      "õ": 156,
      "ö": 157,
      "÷": 158,
      "ø": 159,
      "ù": 160,
      "ú": 161,
      "û": 162,
      "ü": 163,
      "ý": 164,
      "þ": 165,
      "ÿ": 166,
      "œ": 167,
      "Š": 168,
      "š": 169,
      "Ž": 170,
      "ž": 171,
      "́": 172,
      "μ": 173,
      "’": 174,
      "„": 175,
      "†": 176,
      "•": 177,
      "▁": 178,
      "▁e": 179,
      "▁a": 180,
      "▁t": 181,
      "▁n": 182,
      "▁i": 183,
      "▁o": 184,
      "▁r": 185,
      "▁s": 186,
      "▁h": 187,
      "▁l": 188,
      "▁d": 189,
      "▁c": 190,
      "▁u": 191,
      "▁m": 192,
      "▁,": 193,
      "▁'": 194,
      "▁f": 195,
      "▁p": 196,
      "▁g": 197,
      "▁-": 198,
      "▁y": 199,
      "▁b": 200,
      "▁w": 201,
      "▁R": 202,
      "▁.": 203,
      "▁B": 204,
      "▁v": 205,
      "▁k": 206,
      "▁1": 207,
      "▁L": 208,
      "▁S": 209,
      "▁A": 210,
      "▁T": 211,
      "▁C": 212,
      "▁0": 213,
      "▁\"": 214,
      "▁9": 215,
      "▁M": 216,
      "▁I": 217,
      "▁P": 218,
      "▁2": 219,
      "▁F": 220,
      "▁H": 221,
      "▁D": 222,
      "▁G": 223,
      "▁E": 224,
      "▁N": 225,
      "▁W": 226,
      "▁x": 227,
      "▁8": 228,
      "▁J": 229,
      "▁O": 230,
      "▁7": 231,
      "▁z": 232,
      "▁5": 233,
      "▁3": 234,
      "▁4": 235,
      "▁6": 236,
      "▁U": 237,
      "▁K": 238,
      "▁V": 239,
      "▁j": 240,
      "▁q": 241,
      "▁;": 242,
      "▁:": 243,
      "▁/": 244,
      "▁\\": 245,
      "▁Ã": 246,
      "▁Y": 247,
      "▁&": 248,
      "▁â": 249,
      "▁Z": 250,
      "▁é": 251,
      "▁X": 252,
      "▁Q": 253,
      "▁`": 254,
      "▁%": 255,
      "▁á": 256,
      "▁=": 257,
      "▁#": 258,
      "▁ü": 259,
      "▁Å": 260,
      "▁è": 261,
      "▁$": 262,
      "▁Â": 263,
      "▁ö": 264,
      "▁Î": 265,
      "▁í": 266,
      "▁ó": 267,
      "▁Ä": 268,
      "▁_": 269,
      "▁+": 270,
      "▁!": 271,
      "▁Ð": 272,
      "▁à": 273,
      "▁É": 274,
      "▁ä": 275,
      "▁Ø": 276,
      "▁ô": 277,
      "▁ã": 278,
      "▁Ï": 279,
      "▁*": 280,
      "▁å": 281,
      "▁æ": 282,
      "▁ç": 283,
      "▁Ù": 284,
      "▁°": 285,
      "▁ú": 286,
      "▁?": 287,
      "▁ß": 288,
      "▁Ñ": 289,
      "▁ñ": 290,
      "▁Ë": 291,
      "▁ë": 292,
      "▁ê": 293,
      "▁^": 294,
      "▁×": 295,
      "▁ì": 296,
      "▁Ö": 297,
      "▁~": 298,
      "▁ø": 299,
      "▁Á": 300,
      "▁Õ": 301,
      "▁Ê": 302,
      "▁Ú": 303,
      "▁Û": 304,
      "▁î": 305,
      "▁ð": 306,
      "▁ï": 307,
      "▁·": 308,
      "▁ý": 309,
      "▁ò": 310,
      "▁Ó": 311,
      "▁š": 312,
      "▁Æ": 313,
      "▁û": 314,
      "▁|": 315,
      "▁Þ": 316,
      "▁ù": 317,
      "▁Ç": 318,
      "▁È": 319,
      "▁†": 320,
      "▁>": 321,
      "▁Ü": 322,
      "▁ÿ": 323,
      "▁œ": 324,
      "▁±": 325,
      "▁Í": 326,
      "▁Ò": 327,
      "▁@": 328,
      "▁Ì": 329,
      "▁õ": 330,
      "▁Ž": 331,
      "▁<": 332,
      "▁§": 333,
      "▁À": 334,
      "▁þ": 335,
      "▁μ": 336,
      "▁[": 337,
      "▁Ô": 338,
      "▁÷": 339,
      "▁ž": 340,
      "▁́": 341,
      "▁•": 342
    },
    "merges": [
      "▁ e",
      "▁ a",
      "▁ t",
      "▁ n",
      "▁ i",
      "▁ o",
      "▁ r",
      "▁ s",
      "▁ h",
      "▁ l",
      "▁ d",
      "▁ c",
      "▁ u",
      "▁ m",
      "▁ ,",
      "▁ '",
      "▁ f",
      "▁ p",
      "▁ g",
      "▁ -",
      "▁ y",
      "▁ b",
      "▁ w",
      "▁ R",
      "▁ .",
      "▁ B",
      "▁ v",
      "▁ k",
      "▁ 1",
      "▁ L",
      "▁ S",
      "▁ A",
      "▁ T",
      "▁ C",
      "▁ 0",
      "▁ \"",
      "▁ 9",
      "▁ M",
      "▁ I",
      "▁ P",
      "▁ 2",
      "▁ F",
      "▁ H",
      "▁ D",
      "▁ G",
      "▁ E",
      "▁ N",
      "▁ W",
      "▁ x",
      "▁ 8",
      "▁ J",
      "▁ O",
      "▁ 7",
      "▁ z",
      "▁ 5",
      "▁ 3",
      "▁ 4",
      "▁ 6",
      "▁ U",
      "▁ K",
      "▁ V",
      "▁ j",
      "▁ q",
      "▁ ;",
      "▁ :",
      "▁ /",
      "▁ \\",
      "▁ Ã",
      "▁ Y",
      "▁ &",
      "▁ â",
      "▁ Z",
      "▁ é",
      "▁ X",
      "▁ Q",
      "▁ `",
      "▁ %",
      "▁ á",
      "▁ =",
      "▁ #",
      "▁ ü",
      "▁ Å",
      "▁ è",
      "▁ $",
      "▁ Â",
      "▁ ö",
      "▁ Î",
      "▁ í",
      "▁ ó",
      "▁ Ä",
      "▁ _",
      "▁ +",
      "▁ !",
      "▁ Ð",
      "▁ à",
      "▁ É",
      "▁ ä",
      "▁ Ø",
      "▁ ô",
      "▁ ã",
      "▁ Ï",
      "▁ *",
      "▁ å",
      "▁ æ",
      "▁ ç",
      "▁ Ù",
      "▁ °",
      "▁ ú",
      "▁ ?",
      "▁ ß",
      "▁ Ñ",
      "▁ ñ",
      "▁ Ë",
      "▁ ë",
      "▁ ê",
      "▁ ^",
      "▁ ×",
      "▁ ì",
      "▁ Ö",
      "▁ ~",
      "▁ ø",
      "▁ Á",
      "▁ Õ",
      "▁ Ê",
      "▁ Ú",
      "▁ Û",
      "▁ î",
      "▁ ð",
      "▁ ï",
      "▁ ·",
      "▁ ý",
      "▁ ò",
      "▁ Ó",
      "▁ š",
      "▁ Æ",
      "▁ û",
      "▁ |",
      "▁ Þ",
      "▁ ù",
      "▁ Ç",
      "▁ È",
      "▁ †",
      "▁ >",
      "▁ Ü",
      "▁ ÿ",
      "▁ œ",
      "▁ ±",
      "▁ Í",
      "▁ Ò",
      "▁ @",
      "▁ Ì",
      "▁ õ",
      "▁ Ž",
      "▁ <",
      "▁ §",
      "▁ À",
      "▁ þ",
      "▁ μ",
      "▁ [",
      "▁ Ô",
      "▁ ÷",
      "▁ ž",
      "▁ ́",
      "▁ •"
    ]
  }
}